wouyanglv/bmi160/nRF5_SDK_17.0.0_9d13099/examples/ble_peripheral/implantable_MA/main.c
void bsp_event_handler(bsp_event_t event)
{
    ret_code_t err_code;

    switch (event)
    {
        case BSP_EVENT_KEY_3:
            for(uint8_t i=0; i < 10; i++)
            {
               /* err_code = ble_biosig_svc_measurement_send(&m_biosig_svc, timestamp++, 1, 
                                    0x1234, BLE_BIOSIG_DEV_TYPE_EEG);
                while (err_code == NRF_ERROR_RESOURCES) 
                {
                    nrf_delay_ms(300);
                    SEGGER_RTT_printf(0, "SEND STATUS TRYING\r\n");
                    err_code = ble_biosig_svc_measurement_send(&m_biosig_svc, timestamp++, 1,
                                    0x1234, BLE_BIOSIG_DEV_TYPE_EEG);
                }
                nrf_delay_ms(100);*/
            }
//            SEGGER_RTT_printf(0, "BLE: %lu\r\n", timestamp);
        break;

        case BSP_EVENT_SLEEP:
            sleep_mode_enter();
            break;

        case BSP_EVENT_DISCONNECT:
            err_code = sd_ble_gap_disconnect(m_conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        case BSP_EVENT_WHITELIST_OFF:
            if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
            {
                err_code = ble_advertising_restart_without_whitelist(&m_advertising);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }
            }
            break;

        default:
            break;
    }
}


/**@brief Function for the Peer Manager initialization.
 */
static void peer_manager_init(void)
{
    ble_gap_sec_params_t sec_param;
    ret_code_t           err_code;

    err_code = pm_init();
    APP_ERROR_CHECK(err_code);

    memset(&sec_param, 0, sizeof(ble_gap_sec_params_t));

    // Security parameters to be used for all security procedures.
    sec_param.bond           = SEC_PARAM_BOND;
    sec_param.mitm           = SEC_PARAM_MITM;
    sec_param.lesc           = SEC_PARAM_LESC;
    sec_param.keypress       = SEC_PARAM_KEYPRESS;
    sec_param.io_caps        = SEC_PARAM_IO_CAPABILITIES;
    sec_param.oob            = SEC_PARAM_OOB;
    sec_param.min_key_size   = SEC_PARAM_MIN_KEY_SIZE;
    sec_param.max_key_size   = SEC_PARAM_MAX_KEY_SIZE;
    sec_param.kdist_own.enc  = 1;
    sec_param.kdist_own.id   = 1;
    sec_param.kdist_peer.enc = 1;
    sec_param.kdist_peer.id  = 1;

    err_code = pm_sec_params_set(&sec_param);
    APP_ERROR_CHECK(err_code);

    err_code = pm_register(pm_evt_handler);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    ret_code_t             err_code;
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance      = true;
    init.advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.advdata.uuids_complete.p_uuids  = m_adv_uuids;
    
    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;

    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    ret_code_t err_code;
    bsp_event_t startup_event;

#ifdef NRF52_DK
    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);
#endif

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    ret_code_t err_code;

    err_code = nrf_ble_lesc_request_handler();
    APP_ERROR_CHECK(err_code);

    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


//static void eeg_data_avail_handler()
//{
//    m_eeg_data_avail = true;
//}
//
//static void emg_data_avail_handler()
//{
//    m_emg_data_avail = true;
//}


//static void read_sensor_data(max30003_dev_t *dev, ble_biosig_svc_dev_type dev_type)
//{
//    uint32_t ecgFIFO, ETAG, status;
//    int16_t ecgSample;
//    int16_t ecgSamples[32];
//    uint64_t last_sample_timestamp;
//    uint8_t num_samples = 0;
//    uint8_t i;
//    ret_code_t ret;
//    ret_code_t err_code;
//    bool retry_ble_send = false;
//  
//    /* Read back ECG samples from the FIFO */
//    ret = max30003_get_status(dev, &status);      // Read the STATUS register
//
//    // Check if EINT interrupt asserted
//    if ((status & EINT_STATUS) == EINT_STATUS) 
//    {     
//        last_sample_timestamp = rtc_timestamp_get();
//        
//        do 
//        {
//            max30003_get_fifo(dev, &ecgFIFO);                        // Read FIFO
//
//            ecgSample = (ecgFIFO >> 8) & 0xFFFF;   // Isolate voltage data
//            ETAG = (ecgFIFO >> 3) & ETAG_BITS;     // Isolate ETAG
//    
//            ecgSamples[num_samples] = ecgSample;
////            if (num_samples == 15) {SEGGER_RTT_printf(0, "Device : %d, No. %d, Signal: %d\n\r", dev_type, num_samples, ecgSample);}
//            num_samples++;
//        } 
//        while (ETAG == FIFO_VALID_SAMPLE || ETAG == FIFO_FAST_SAMPLE);   // Check that sample is not last sample in FIFO              
//
////        SEGGER_RTT_printf(0, "ETAG: %d\r\n", ETAG);
////        SEGGER_RTT_printf(0, "%d samples read from FIFO\r\n", num_samples);
//    
//        // Check if FIFO has overflowed
//        if(ETAG == FIFO_OVF)
//        {                  
//            max30003_reset_fifo(dev); // Reset FIFO
// //           SEGGER_RTT_printf(0, "FIFO overflow!\r\n");
//        }
//
//#ifndef SEND_BLE
//        // Send and display received samples
//
//            // send sample over BLE
//            err_code = ble_biosig_svc_measurement_send(&m_biosig_svc, last_sample_timestamp, 
//                                    num_samples, ecgSamples, dev_type);
//
//            while (err_code == NRF_ERROR_RESOURCES) 
//            {
//                nrf_delay_ms(100);
//                retry_ble_send = true;
////                SEGGER_RTT_printf(0, "SEND STATUS TRYING\r\n");
//                err_code = ble_biosig_svc_measurement_send(&m_biosig_svc, last_sample_timestamp, 
//                                    num_samples, ecgSamples, dev_type);
//            }
//            if ((err_code != NRF_SUCCESS) &&
//                (err_code != NRF_ERROR_INVALID_STATE) &&
//                (err_code != NRF_ERROR_RESOURCES) &&
//                (err_code != NRF_ERROR_BUSY) &&
//                (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
//               )
//            {
//                APP_ERROR_HANDLER(err_code);
//            }
//
//
//#endif
//    }
//    else if ((status & EOVF_STATUS) == EOVF_STATUS)
//    {
//        max30003_reset_fifo(dev); // Reset FIFO
//    }
//
//    // Check if FIFO overflowed while we were sending BLE data, if so reset the FIFO
//    ret = max30003_get_status(dev, &status);      // Read the STATUS register
//    if ((status & EOVF_STATUS) == EOVF_STATUS)
//    {
//        max30003_reset_fifo(dev); // Reset FIFO
//    }
//}


